water-hammer/fluid3d-right-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        outOfBounds     clamp;
        // Time-varying outlet velocity
        type            uniformFixedValue;
        uniformValue    table
                        (
                            ( 0   ( 0 0 0 ) )
                            ( 5   ( 0 1 0 ) )
                            ( 100 ( 0 1 0 ) )
                        );
    }
    fixedWalls
    {
        type    fixedValue;         // no-slip walls
        value   uniform (0 0 0);
    }
}


// ************************************************************************* //
