water-hammer/fluid3d-right-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid3DRight;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid3DRight-Mesh;
    patches           (inlet);
    
    readData
    (
      Pressure
    );
    
    writeData
    (
      Velocity
    );
  };
};